Revit 2027 API
EdgeArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual EdgeArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As EdgeArrayIterator
public:
virtual EdgeArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> EdgeArrayIterator
override ReverseIterator : unit -> EdgeArrayIterator
Return Value
EdgeArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
EdgeArray Class
Autodesk.Revit.DB Namespace